Revit 2027 API
ExtendedPropertiesBindings(ExtendedPropertiesBindingType, ISet<ForgeTypeId>) Constructor
 Creates a new ExtendedPropertiesBindings
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExtendedPropertiesBindings(
	ExtendedPropertiesBindingType bindingType,
	ISet<ForgeTypeId> boundCategories
)
Public Sub New (
	bindingType As ExtendedPropertiesBindingType,
	boundCategories As ISet(Of ForgeTypeId)
)
public:
ExtendedPropertiesBindings(
	ExtendedPropertiesBindingType bindingType,
	ISet<ForgeTypeId^>^ boundCategories
)
new :
        bindingType : ExtendedPropertiesBindingType *
        boundCategories : ISet<ForgeTypeId> -> ExtendedPropertiesBindings
Parameters
bindingType ExtendedPropertiesBindingType
 Binding type.
boundCategories ISet<ForgeTypeId>
 Identifiers of the categories for this binding.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ExtendedPropertiesBindings Class
ExtendedPropertiesBindings Overload
Autodesk.Revit.DB.ExternalData Namespace